# GroupHadFailedElementsWhileUpdating Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..GroupHadFailedElementsWhileUpdating Property
BuiltInFailures..::..GroupFailures Class See Also
---
Group members failed while updating group.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GroupHadFailedElementsWhileUpdating { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GroupHadFailedElementsWhileUpdating As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GroupHadFailedElementsWhileUpdating {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace